import { defineStore } from "pinia";
import { ref } from "vue";

export const useQuestionStroe = defineStore("useQuestion", () => {
  const questions = ref([]);

  const setQuestion = (value) => {
    questions.value = value;
  };
  const questionsMock = [
    {
      id: 1,
      question: "ประโยคคืออะไร",
      choices: [
        "ก. คำที่มีตัวสะกด",
        "ข. คำที่มีสองพยางค์ขึ้นไป",
        "ค. การนำคำ หรือกลุ่มคำมาเรียนต่อกันให้ได้เนื้อความที่สมบูรณ์",
      ],
      answer: 1,
    },
    {
      id: 2,
      question: "ประโยคคืออะไร",
      image_name: 'questions.jpg',
      choices: [
        "ก. คำที่มีตัวสะกด",
        "ข. คำที่มีสองพยางค์ขึ้นไป",
        "ค. การนำคำ หรือกลุ่มคำมาเรียนต่อกันให้ได้เนื้อความที่สมบูรณ์",
      ],
      answer: 1,
    },
    {
      id: 3,
      question: "ประโยคคืออะไร",
      choices: [
        "ก. คำที่มีตัวสะกด",
        "ข. คำที่มีสองพยางค์ขึ้นไป",
        "ค. การนำคำ หรือกลุ่มคำมาเรียนต่อกันให้ได้เนื้อความที่สมบูรณ์",
      ],
      answer: 1,
    },
    {
      id: 4,
      question: "ประโยคคืออะไร",
      choices: [
        "ก. คำที่มีตัวสะกด",
        "ข. คำที่มีสองพยางค์ขึ้นไป",
        "ค. การนำคำ หรือกลุ่มคำมาเรียนต่อกันให้ได้เนื้อความที่สมบูรณ์",
      ],
      answer: 1,
    },
    {
      id: 5,
      question: "ประโยคคืออะไร",
      choices: [
        "ก. คำที่มีตัวสะกด",
        "ข. คำที่มีสองพยางค์ขึ้นไป",
        "ค. การนำคำ หรือกลุ่มคำมาเรียนต่อกันให้ได้เนื้อความที่สมบูรณ์",
      ],
      answer: 1,
    },
    {
      id: 6,
      question: "ประโยคคืออะไร",
      choices: [
        "ก. คำที่มีตัวสะกด",
        "ข. คำที่มีสองพยางค์ขึ้นไป",
        "ค. การนำคำ หรือกลุ่มคำมาเรียนต่อกันให้ได้เนื้อความที่สมบูรณ์",
      ],
      answer: 1,
    },
    {
      id: 7,
      question: "ประโยคคืออะไร",
      choices: [
        "ก. คำที่มีตัวสะกด",
        "ข. คำที่มีสองพยางค์ขึ้นไป",
        "ค. การนำคำ หรือกลุ่มคำมาเรียนต่อกันให้ได้เนื้อความที่สมบูรณ์",
      ],
      answer: 1,
    },
    {
      id: 8,
      question: "ประโยคคืออะไร",
      choices: [
        "ก. คำที่มีตัวสะกด",
        "ข. คำที่มีสองพยางค์ขึ้นไป",
        "ค. การนำคำ หรือกลุ่มคำมาเรียนต่อกันให้ได้เนื้อความที่สมบูรณ์",
      ],
      answer: 1,
    },
    {
      id: 9,
      question: "ประโยคคืออะไร",
      choices: [
        "ก. คำที่มีตัวสะกด",
        "ข. คำที่มีสองพยางค์ขึ้นไป",
        "ค. การนำคำ หรือกลุ่มคำมาเรียนต่อกันให้ได้เนื้อความที่สมบูรณ์",
      ],
      answer: 1,
    },
    {
      id: 10,
      question: "ประโยคคืออะไร",
      choices: [
        "ก. คำที่มีตัวสะกด",
        "ข. คำที่มีสองพยางค์ขึ้นไป",
        "ค. การนำคำ หรือกลุ่มคำมาเรียนต่อกันให้ได้เนื้อความที่สมบูรณ์",
      ],
      answer: 1,
    },
  ];
  setQuestion(questionsMock);
  return {
    setQuestion,
    questions,
  };
});
